MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKV42F128VLH16/mcu.h
/*! @name CLIST1 - ADC Channel List Register 1 */
/*! @{ */
#define ADC_CLIST1_SAMPLE0_MASK                  (0xFU)
#define ADC_CLIST1_SAMPLE0_SHIFT                 (0U)
/*! SAMPLE0 - Sample Field 0
 *  0b0000..Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0001..Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0010..Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0011..Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0100..Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0101..Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0110..Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b0111..Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b1000..Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1001..Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1010..Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1011..Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1100..Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1101..Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1110..Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-
 *  0b1111..Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-
 */
#define ADC_CLIST1_SAMPLE0(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST1_SAMPLE0_SHIFT)) & ADC_CLIST1_SAMPLE0_MASK)
#define ADC_CLIST1_SAMPLE1_MASK                  (0xF0U)
#define ADC_CLIST1_SAMPLE1_SHIFT                 (4U)
/*! SAMPLE1 - Sample Field 1
 *  0b0000..Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0001..Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0010..Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0011..Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0100..Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0101..Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0110..Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b0111..Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b1000..Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1001..Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1010..Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1011..Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1100..Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1101..Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1110..Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-
 *  0b1111..Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-
 */
#define ADC_CLIST1_SAMPLE1(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST1_SAMPLE1_SHIFT)) & ADC_CLIST1_SAMPLE1_MASK)
#define ADC_CLIST1_SAMPLE2_MASK                  (0xF00U)
#define ADC_CLIST1_SAMPLE2_SHIFT                 (8U)
/*! SAMPLE2 - Sample Field 2
 *  0b0000..Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0001..Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0010..Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0011..Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0100..Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0101..Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0110..Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b0111..Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b1000..Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1001..Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1010..Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1011..Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1100..Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1101..Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1110..Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-
 *  0b1111..Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-
 */
#define ADC_CLIST1_SAMPLE2(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST1_SAMPLE2_SHIFT)) & ADC_CLIST1_SAMPLE2_MASK)
#define ADC_CLIST1_SAMPLE3_MASK                  (0xF000U)
#define ADC_CLIST1_SAMPLE3_SHIFT                 (12U)
/*! SAMPLE3 - Sample Field 3
 *  0b0000..Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0001..Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0010..Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0011..Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0100..Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0101..Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0110..Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b0111..Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b1000..Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1001..Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1010..Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1011..Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1100..Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1101..Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1110..Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-
 *  0b1111..Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-
 */
#define ADC_CLIST1_SAMPLE3(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST1_SAMPLE3_SHIFT)) & ADC_CLIST1_SAMPLE3_MASK)
/*! @} */

/*! @name CLIST2 - ADC Channel List Register 2 */
/*! @{ */
#define ADC_CLIST2_SAMPLE4_MASK                  (0xFU)
#define ADC_CLIST2_SAMPLE4_SHIFT                 (0U)
/*! SAMPLE4 - Sample Field 4
 *  0b0000..Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0001..Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0010..Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0011..Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0100..Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0101..Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0110..Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b0111..Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b1000..Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1001..Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1010..Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1011..Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1100..Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1101..Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1110..Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-
 *  0b1111..Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-
 */
#define ADC_CLIST2_SAMPLE4(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST2_SAMPLE4_SHIFT)) & ADC_CLIST2_SAMPLE4_MASK)
#define ADC_CLIST2_SAMPLE5_MASK                  (0xF0U)
#define ADC_CLIST2_SAMPLE5_SHIFT                 (4U)
/*! SAMPLE5 - Sample Field 5
 *  0b0000..Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0001..Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0010..Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0011..Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0100..Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0101..Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0110..Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b0111..Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b1000..Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1001..Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1010..Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1011..Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1100..Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1101..Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1110..Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-
 *  0b1111..Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-
 */
#define ADC_CLIST2_SAMPLE5(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST2_SAMPLE5_SHIFT)) & ADC_CLIST2_SAMPLE5_MASK)
#define ADC_CLIST2_SAMPLE6_MASK                  (0xF00U)
#define ADC_CLIST2_SAMPLE6_SHIFT                 (8U)
/*! SAMPLE6 - Sample Field 6
 *  0b0000..Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0001..Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0010..Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0011..Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0100..Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0101..Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0110..Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b0111..Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b1000..Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1001..Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1010..Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1011..Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1100..Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1101..Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1110..Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-
 *  0b1111..Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-
 */
#define ADC_CLIST2_SAMPLE6(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST2_SAMPLE6_SHIFT)) & ADC_CLIST2_SAMPLE6_MASK)
#define ADC_CLIST2_SAMPLE7_MASK                  (0xF000U)
#define ADC_CLIST2_SAMPLE7_SHIFT                 (12U)
/*! SAMPLE7 - Sample Field 7
 *  0b0000..Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0001..Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0010..Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0011..Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0100..Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0101..Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0110..Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b0111..Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b1000..Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1001..Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1010..Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1011..Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1100..Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1101..Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1110..Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-
 *  0b1111..Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-
 */
#define ADC_CLIST2_SAMPLE7(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST2_SAMPLE7_SHIFT)) & ADC_CLIST2_SAMPLE7_MASK)
/*! @} */

/*! @name CLIST3 - ADC Channel List Register 3 */
/*! @{ */
#define ADC_CLIST3_SAMPLE8_MASK                  (0xFU)
#define ADC_CLIST3_SAMPLE8_SHIFT                 (0U)
/*! SAMPLE8 - Sample Field 8
 *  0b0000..Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0001..Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0010..Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0011..Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0100..Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0101..Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0110..Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b0111..Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b1000..Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1001..Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1010..Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1011..Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1100..Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1101..Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1110..Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-
 *  0b1111..Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-
 */
#define ADC_CLIST3_SAMPLE8(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST3_SAMPLE8_SHIFT)) & ADC_CLIST3_SAMPLE8_MASK)
#define ADC_CLIST3_SAMPLE9_MASK                  (0xF0U)
#define ADC_CLIST3_SAMPLE9_SHIFT                 (4U)
/*! SAMPLE9 - Sample Field 9
 *  0b0000..Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0001..Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0010..Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0011..Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0100..Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0101..Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0110..Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b0111..Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b1000..Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1001..Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1010..Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1011..Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1100..Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1101..Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1110..Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-
 *  0b1111..Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-
 */
#define ADC_CLIST3_SAMPLE9(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST3_SAMPLE9_SHIFT)) & ADC_CLIST3_SAMPLE9_MASK)
#define ADC_CLIST3_SAMPLE10_MASK                 (0xF00U)
#define ADC_CLIST3_SAMPLE10_SHIFT                (8U)
/*! SAMPLE10 - Sample Field 10
 *  0b0000..Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0001..Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0010..Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0011..Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0100..Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0101..Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0110..Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b0111..Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b1000..Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1001..Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1010..Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1011..Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1100..Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1101..Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1110..Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-
 *  0b1111..Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-
 */
#define ADC_CLIST3_SAMPLE10(x)                   (((uint16_t)(((uint16_t)(x)) << ADC_CLIST3_SAMPLE10_SHIFT)) & ADC_CLIST3_SAMPLE10_MASK)
#define ADC_CLIST3_SAMPLE11_MASK                 (0xF000U)
#define ADC_CLIST3_SAMPLE11_SHIFT                (12U)
/*! SAMPLE11 - Sample Field 11
 *  0b0000..Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0001..Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-
 *  0b0010..Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0011..Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-
 *  0b0100..Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0101..Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-
 *  0b0110..Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b0111..Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-
 *  0b1000..Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1001..Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-
 *  0b1010..Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1011..Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-
 *  0b1100..Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1101..Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-
 *  0b1110..Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-
 *  0b1111..Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-
 */
#define ADC_CLIST3_SAMPLE11(x)                   (((uint16_t)(((uint16_t)(x)) << ADC_CLIST3_SAMPLE11_SHIFT)) & ADC_CLIST3_SAMPLE11_MASK)
/*! @} */

